In [8]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### You are given the two tables below containing information on the topics that each Twitter user follows and the ranks of each of these topics. Write a query to obtain all existing users on 2025-01-01 that did not follow any topic in the 2 most popular topics for that day.

In [9]:
%%sql

SELECT * FROM user_topics LIMIT 10;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(3, 5, datetime.datetime(2025, 8, 10, 7, 17, 24, 578977)),
 (1, 8, datetime.datetime(2025, 8, 11, 7, 17, 24, 578977)),
 (6, 3, datetime.datetime(2025, 8, 12, 7, 17, 24, 578977)),
 (2, 7, datetime.datetime(2025, 8, 13, 7, 17, 24, 578977)),
 (4, 2, datetime.datetime(2025, 8, 14, 7, 17, 24, 578977)),
 (5, 9, datetime.datetime(2025, 8, 15, 7, 17, 24, 578977)),
 (1, 4, datetime.datetime(2025, 8, 16, 7, 17, 24, 578977)),
 (6, 6, datetime.datetime(2025, 8, 17, 7, 17, 24, 578977)),
 (3, 1, datetime.datetime(2025, 8, 18, 7, 17, 24, 578977)),
 (2, 10, datetime.datetime(2025, 8, 19, 7, 17, 24, 578977))]

In [11]:
%%sql

SELECT * FROM topic_rankings LIMIT 10;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(3, 5, datetime.datetime(2025, 8, 10, 7, 17, 24, 580745)),
 (1, 8, datetime.datetime(2025, 8, 11, 7, 17, 24, 580745)),
 (6, 3, datetime.datetime(2025, 8, 12, 7, 17, 24, 580745)),
 (2, 7, datetime.datetime(2025, 8, 13, 7, 17, 24, 580745)),
 (4, 2, datetime.datetime(2025, 8, 14, 7, 17, 24, 580745)),
 (5, 9, datetime.datetime(2025, 8, 15, 7, 17, 24, 580745)),
 (1, 4, datetime.datetime(2025, 8, 16, 7, 17, 24, 580745)),
 (6, 6, datetime.datetime(2025, 8, 17, 7, 17, 24, 580745)),
 (3, 1, datetime.datetime(2025, 8, 18, 7, 17, 24, 580745)),
 (2, 10, datetime.datetime(2025, 8, 19, 7, 17, 24, 580745))]

In [10]:
%%sql 

WITH top_topics AS (
    SELECT topic_id
    FROM topic_rankings
    WHERE ranking_date = DATE '2025-01-01'
    ORDER BY ranking ASC
    LIMIT 2
),
users_in_top AS (
    SELECT DISTINCT ut.user_id
    FROM user_topics ut
    JOIN top_topics tt ON ut.topic_id = tt.topic_id
),
all_users AS (
    SELECT DISTINCT user_id
    FROM user_topics
)
SELECT au.user_id
FROM all_users au
LEFT JOIN users_in_top uit ON au.user_id = uit.user_id
WHERE uit.user_id IS NULL;

 * postgresql://user:***@localhost:5432/postgres
6 rows affected.

[(3,), (5,), (4,), (6,), (2,), (1,)]